# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [2]:
import pandas as pd
import numpy as np

In [67]:
from numpy.random import randn
np.random.seed(101) #The random module uses the seed value as a base to generate a random number.

2.706849839399938

In [70]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [71]:
df

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [72]:
df['W']

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: W, dtype: float64

In [73]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  1.693723 -0.134841
B  0.390528  0.807706
C  0.072960 -0.497104
D -0.754070 -0.116773
E  1.901755 -0.993263

DataFrame Columns are just Series

In [86]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [94]:
df['new'] = df['W'] + df['Y']

In [95]:
df

          W         X         Y         Z       new
A  1.693723 -1.706086 -1.159119 -0.134841  0.534604
B  0.390528  0.166905  0.184502  0.807706  0.575030
C  0.072960  0.638787  0.329646 -0.497104  0.402606
D -0.754070 -0.943406  0.484752 -0.116773 -0.269318
E  1.901755  0.238127  1.996652 -0.993263  3.898407

** Removing Columns**

In [96]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

In [97]:
# Not inplace unless specified
df

          W         X         Y         Z       new
A  1.693723 -1.706086 -1.159119 -0.134841  0.534604
B  0.390528  0.166905  0.184502  0.807706  0.575030
C  0.072960  0.638787  0.329646 -0.497104  0.402606
D -0.754070 -0.943406  0.484752 -0.116773 -0.269318
E  1.901755  0.238127  1.996652 -0.993263  3.898407

In [98]:
df.drop('new',axis=1,inplace=True)

In [99]:
df

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

Can also drop rows this way:

In [101]:
df.drop('E',axis=0) #or df.drop('E')

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773

** Selecting Rows**

In [102]:
df.loc['A']

W    1.693723
X   -1.706086
Y   -1.159119
Z   -0.134841
Name: A, dtype: float64

Or select based off of position instead of label

In [104]:
df.iloc[2]

W    0.072960
X    0.638787
Y    0.329646
Z   -0.497104
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [105]:
df.loc['B','Y'] #or df.loc['B']['Y']

0.18450185928224264

In [108]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.693723 -1.159119
B  0.390528  0.184502

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [109]:
df

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

In [110]:
df>0

       W      X      Y      Z
A   True  False  False  False
B   True   True   True   True
C   True   True   True  False
D  False  False   True  False
E   True   True   True  False

In [111]:
df[df>0]

          W         X         Y         Z
A  1.693723       NaN       NaN       NaN
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646       NaN
D       NaN       NaN  0.484752       NaN
E  1.901755  0.238127  1.996652       NaN

In [112]:
df['W']>0

A     True
B     True
C     True
D    False
E     True
Name: W, dtype: bool

In [113]:
df[df['W']>0]

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
E  1.901755  0.238127  1.996652 -0.993263

In [114]:
df[df['W']>0]['Y']

A   -1.159119
B    0.184502
C    0.329646
E    1.996652
Name: Y, dtype: float64

In [115]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.159119 -1.706086
B  0.184502  0.166905
C  0.329646  0.638787
E  1.996652  0.238127

For two conditions you can use | and & with parenthesis:

In [116]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  1.901755  0.238127  1.996652 -0.993263

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [117]:
df

          W         X         Y         Z
A  1.693723 -1.706086 -1.159119 -0.134841
B  0.390528  0.166905  0.184502  0.807706
C  0.072960  0.638787  0.329646 -0.497104
D -0.754070 -0.943406  0.484752 -0.116773
E  1.901755  0.238127  1.996652 -0.993263

In [119]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  1.693723 -1.706086 -1.159119 -0.134841
1     B  0.390528  0.166905  0.184502  0.807706
2     C  0.072960  0.638787  0.329646 -0.497104
3     D -0.754070 -0.943406  0.484752 -0.116773
4     E  1.901755  0.238127  1.996652 -0.993263

In [121]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [122]:
df['States'] = newind

In [10]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [123]:
df.set_index('States')

               W         X         Y         Z
States
CA      1.693723 -1.706086 -1.159119 -0.134841
NY      0.390528  0.166905  0.184502  0.807706
WY      0.072960  0.638787  0.329646 -0.497104
OR     -0.754070 -0.943406  0.484752 -0.116773
CO      1.901755  0.238127  1.996652 -0.993263

In [124]:
df

          W         X         Y         Z States
A  1.693723 -1.706086 -1.159119 -0.134841     CA
B  0.390528  0.166905  0.184502  0.807706     NY
C  0.072960  0.638787  0.329646 -0.497104     WY
D -0.754070 -0.943406  0.484752 -0.116773     OR
E  1.901755  0.238127  1.996652 -0.993263     CO

In [125]:
df.set_index('States',inplace=True)

In [126]:
df

               W         X         Y         Z
States
CA      1.693723 -1.706086 -1.159119 -0.134841
NY      0.390528  0.166905  0.184502  0.807706
WY      0.072960  0.638787  0.329646 -0.497104
OR     -0.754070 -0.943406  0.484752 -0.116773
CO      1.901755  0.238127  1.996652 -0.993263